[
  {
    "id": 1,
    "title": "About This Portfolio and Learning System",
    "date": "January 11, 2026",
    "excerpt": "An overview of how this portfolio doubles as a learning system, using interview‑driven articles, structured content, and hands‑on experimentation to build senior‑level frontend engineering skills.",
    "category": "Frontend Frameworks",
    "image": "/johnny_hammond.webp",
    "link": "/blog/about-this-portfolio-and-learning-system",
    "author": "Johnny Hammond",
    "tags": ["Frontend"],
    "content": "<p><strong>About this portfolio.</strong> This site serves both as a professional portfolio and as an active learning environment. It showcases frontend engineering skills while also acting as a sandbox for experimentation with modern tooling, system design, and large language models. Rather than presenting static examples, the portfolio is intentionally built to evolve alongside ongoing learning.</p>\n\n<p>The articles on this site are part of a deliberate study process focused on senior‑level frontend engineering concepts. Most posts are generated from interview questions derived directly from real job descriptions. Those questions are then answered in long‑form, blog‑style explanations designed to mirror how experienced engineers reason about architecture, tradeoffs, and decision‑making.</p>\n\n<h2>Why this site uses AI‑generated technical articles</h2>\n\n<p>Job descriptions contain more signal than a simple list of requirements. They implicitly describe how a company thinks about scale, testing, architecture, and developer experience. Those signals are extracted and converted into interview‑style questions, which then become the foundation for each article.</p>\n\n<p>The generated articles are not treated as finished knowledge. Each one is reviewed critically, fact‑checked against documentation and real‑world experience, and then used as a reference while improving the codebase behind this portfolio. Gaps in understanding are intentionally surfaced and turned into follow‑up projects or deeper investigations.</p>\n\n<h2>How the blogging system works</h2>\n\n<p>The process starts by selecting a real job posting and converting it into a structured input. That input is used to generate interview questions and long‑form answers written in a neutral, third‑person voice, modeled after how senior engineers explain concepts to teammates.</p>\n\n<p>Each article is exported as structured JSON that aligns with the site’s internal content system and component architecture. The content is then imported into the codebase, where tooling and editor automation transform it into fully rendered blog posts.</p>\n\n<p>This workflow makes it easy to iterate quickly: update prompts, regenerate articles, refine structure, and immediately test how the content behaves inside the live application.</p>\n\n<h2>How learning happens beyond reading</h2>\n\n<p>Reading alone is not the goal. Concepts explored in articles are applied directly to the portfolio through refactors, new components, improved testing strategies, and architectural changes. When patterns repeat across articles, they are reinforced through hands‑on implementation.</p>\n\n<p>The system is designed to expand over time. Planned additions include short quizzes, technical assessments, and interactive challenges connected to each article. Longer‑term experimentation includes using assessment results to identify weak areas and generate targeted follow‑up content automatically.</p>\n\n<h2>Example interview questions explored so far</h2>\n\n<ul>\n  <li>How do you decide when to create reusable components versus feature‑specific components?</li>\n  <li>Describe how you handle async data fetching, caching, and invalidation in React.</li>\n  <li>How do you decide what belongs in unit tests vs integration tests on the frontend?</li>\n  <li>When do you allow <code>any</code> or type assertions, and how do you control the risk?</li>\n</ul>\n\n<h2>Design inspiration and motivation</h2>\n\n<p>The visual design and reading experience of this site were inspired by the Mark43 engineering blog. After encountering their technical assessment and reflecting on areas for growth, the decision was made to build a personal system that combines study, practice, and public documentation.</p>\n\n<p>The result is a portfolio that is not just a showcase of past work, but a record of ongoing improvement. The intent is to learn in public, document the process honestly, and continuously raise the bar on both technical depth and execution quality.</p>"
  }
]
