[
  {
    "id": 1,
    "title": "About Me And Why My Other Blogs Are LLM Generated",
    "date": "January 19, 2026",
    "excerpt": "An overview of how this portfolio doubles as a learning system, using interview‑driven articles, structured content, and hands‑on experimentation to build senior‑level frontend engineering skills.",
    "category": "Frontend Frameworks",
    "image": "/johnny_hammond.webp",
    "link": "/blog/about-this-portfolio-and-learning-system",
    "author": "Johnny Hammond",
    "tags": ["Frontend"],
    "content": "<p><strong>Hi! My name is Jonathan Hammond.</strong> I’m a Frontend Engineer actively seeking new opportunities. I created this portfolio to showcase my technical abilities and to serve as a sandbox for exploring new technologies, system design concepts, algorithms, and—most importantly—large language models (LLMs). Many of the technical articles on this site are AI-generated and presented from the perspective of a senior software engineer. The goal of these articles are not authorship, but learning. This is the only one I have actually writen.</p>\n\n<h2>Why this site uses AI-generated technical articles</h2>\n<p>While preparing for an interview with Mark43, I uploaded their job posting to ChatGPT and generated realistic senior-level interview questions. I then recreated portions of their website UI and used AI to produce detailed technical answers in a structured blog format. What started as interview preparation quickly turned into a broader system for innovative and deliberate learning.</p>\n\n<p><strong>Important disclosure:</strong> all of the technical articles (with <i>LLM Writer</i> as the author) on this site are not written by me. They are generated as study material. My role is to read them critically, fact-check them, and turn the concepts into working code and deeper understanding.</p>\n\n<p>Each article becomes part of an active learning loop. When I encounter topics I don’t fully understand, I research them further and apply the ideas directly to my own projects. Over time, I plan to add multiple-choice quizzes and technical assessments so readers can move from passive reading to hands-on practice. The long-term vision includes building a small HackerRank-style system to connect articles with interactive challenges and automated feedback.</p>\n\n<p>In short, the workflow looks like this: read an article, take notes, verify claims with external resources, and apply the lessons to real code. Knowledge gaps become starting points for new experiments, features, and improvements to my portfolio codebase.</p>\n\n<h2>How the blogging system works</h2>\n<p>The process begins with a job description I’m interested in. I convert the posting to PDF and upload it to ChatGPT to generate realistic senior-level interview questions. This approach produces dozens of focused, practical prompts from a single document.</p>\n\n<p>Using a dedicated ChatGPT Project configured with a consistent “senior engineer voice,” I generate answers to those questions in a strict JSON format that matches my blog’s data model. Projects allow me to store templates, upload reference files, and define custom style rules so that every article follows the same structure and tone. The writing guidelines are based on <a href='https://developers.google.com/search/docs/fundamentals/creating-helpful-content' target='_blank'>Google’s recommendations for creating helpful, reliable content.</a></p>\n\n<p>Once a blog file is produced, I load it into my Cursor editor, where custom .cursorrules automatically convert the JSON into reusable components for the site. From there, the real work begins: reading carefully, testing examples, and turning concepts into concrete implementations.</p>\n\n<h2>How this process supports real learning</h2>\n<p>Simply reading technical content isn’t enough. True understanding requires active engagement. That’s why this system is designed around reinforcement techniques such as quizzes, coding challenges, and repeated exposure over time. By integrating new ideas directly into my own projects, I strengthen retention and build practical experience instead of just collecting information.</p>\n\n<p>Future features may include a text-to-speech API for auditory benefit, as well as visual learning tools like React Flow diagrams for interactive decision-making graphics. The overall goal is to combine text, visuals, sound, and practice so that concepts are reinforced from multiple angles.</p>\n\n<p>Identifying weak areas is one of the biggest benefits of this approach. When I struggle with a topic, it becomes a target for deeper study and new mini-projects. Alternating between different subjects—an approach known as interleaving—will help prevent me from being restricted to surface-level familiarity, and encourages flexible problem solving. Eventually I hope to expand into more advanced experimentation with agentic frameworks and AI-assisted assessments.</p>\n\n<p>Below are a few examples of the kinds of interview questions that have already driven articles on this site:</p>\n<ul>\n  <li><a href=\"/resources/blog/reusable-vs-feature-specific-components\" target=\"_blank\" rel=\"noopener noreferrer\">How do you decide when to create reusable components versus feature-specific components?</a></li>\n  <li><a href=\"/resources/blog/async-data-fetching-caching-and-invalidation-in-react\" target=\"_blank\" rel=\"noopener noreferrer\">Describe how you handle async data fetching, caching, and invalidation in React.</a></li>\n  <li><a href=\"/resources/blog/unit-tests-vs-integration-tests-on-the-frontend-what-goes-where\" target=\"_blank\" rel=\"noopener noreferrer\">How do you decide what belongs in unit tests vs integration tests on the frontend?</a></li>\n  <li><a href=\"/resources/blog/when-to-use-any-or-type-assertions-and-how-to-control-the-risk\" target=\"_blank\" rel=\"noopener noreferrer\">When do you allow <code>any</code> or type assertions, and how do you control the risk?</a></li>\n</ul>\n\n<h2>Design inspiration and goals</h2>\n<p>The visual design of this portfolio was heavily inspired by <a href='https://www.mark43.com' target='_blank'>Mark43</a>, a company I interviewed for in early January. After seeing their blogging interface, I challenged myself to reproduce something similar from scratch. I then got carried away and created an entire theme picking system (see: bottom left corner). Struggling through their technical assessment motivated me to build a structured system for improving my skills in public.</p>\n\n<p>If you’re a recruiter or engineering manager, this site is meant to demonstrate how I learn, how I think, and how I turn abstract ideas into working software. If you’re another developer, I hope some of these articles and experiments are useful to you as well.</p>\n\n<p>If you have questions, feedback, or opportunities you'd like to discuss, feel free to <a href=\"https://floatingpla.net/#contact\">reach out</a> on LinkedIn or by email.</p>"

  }
]
