[{"id":23,"title":"Johnny Hammond's Path Into Software Engineering - Candidate Spotlight #13","date":"January 6, 2026","excerpt":"A video spotlight on the path into software engineering, career transition, and job search insights.","category":"Video Interviews","image":"/johnny_hammond.webp","link":"/blog/johnny-hammonds-path-into-software-engineering-candidate-spotlight-13","slug":"johnny-hammonds-path-into-software-engineering-candidate-spotlight-13","author":"Johnny Hammond","tags":["Job Search","Video Interviews","Career"],"content":"<p><strong>Interview question:</strong> “What has your path into software engineering looked like?”</p><p>In this episode of \"The Offer Letter\", Brian Piotrowski, Director of Talent Acquisiton at EXP, interviews me on my non-traditional path into tech. I talk about how I worked through various gigs, sales, and IT jobs until landing my first web developer role. We also talk about my #100DaysOfCode challenges, as well as my recently published Chrome Extension project, <a href=\"https://chromewebstore.google.com/detail/docs-summarizer/cbohkbdgjdpmoffedjbcdagmhpjdbiag\" target=\"_blank\" rel=\"noopener noreferrer\">Docs Summarizer</a>.</p><div class=\"explanation\"><p>Special thanks to Brian for having me on. This was a great opportunity for me to discuss my background, and talk about the many hurdles needing to be overcome when navigating the tech market in 2026 as an entry-to-intermediate level software developer. Watch the full video below.</p></div><h2>Watch the spotlight</h2><div class=\"example\"><div class=\"youtube-embed\" data-video-id=\"fLtCRU6Vzz4\" data-title=\"Johnny Hammond's Path Into Software Engineering - Candidate Spotlight #13\"></div></div><div class=\"takeaway\"><p><strong>Closing Thoughts:</strong> If you’re exploring a move into software engineering or are in the middle of a job search, my story might be one worth hearing. Many of our job search challenges are more common than one would think. If you’d ever like to reach out to discuss this and more, please feel free to <a href=\"https://www.linkedin.com/in/jonamichahammo\" target=\"_blank\" rel=\"noopener noreferrer\">contact me on LinkedIn</a></p></div>"}]
